In [ ]:
import numpy as np
import pandas as pd

In [2]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [4]:
df=pd.DataFrame(d)

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna()   # any rows with missing values will be deleted

     A    B  C
0  1.0  5.0  1

In [7]:
df.dropna(axis=1)  # axis=1--> column

   C
0  1
1  2
2  3

In [8]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
df.fillna('FILLED VALUE')

              A             B  C
0           1.0           5.0  1
1           2.0  FILLED VALUE  2
2  FILLED VALUE  FILLED VALUE  3

In [12]:
df.fillna('x')

     A    B  C
0  1.0  5.0  1
1  2.0    x  2
2    x    x  3

In [13]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [14]:
df['A'].fillna(value=df['A'].mean())  # filling the nan spaces withh mean value of column 'A'

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [ ]:
df['A'].fillna(df['A'].mean())